Revit 2027 API
FamilyManager.IsParameterLockable Method
 For Conceptual Mass and Curtain Panel families, indicate whether the specified parameter can be locked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsParameterLockable(
	FamilyParameter familyParameter
)
Public Function IsParameterLockable (
	familyParameter As FamilyParameter
) As Boolean
public:
bool IsParameterLockable(
	FamilyParameter^ familyParameter
)
member IsParameterLockable :
        familyParameter : FamilyParameter -> bool
Parameters
familyParameter FamilyParameter
Return Value
Boolean
 True if the family is a Conceptual Mass or Curtain Panel Family and the parameter drives one or more dimensions; false otherwise.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace